mytechnotalent/Embedded-Hacking/drivers/0x08_lcd1602_cbm/Src/rp2350_lcd1602.c
/**
 * @file rp2350_lcd1602.c
 * @brief LCD1602 driver implementation for RP2350.
 * @author Kevin Thomas
 * @date 2026
 *
 * Drives a 16x2 HD44780 LCD through a PCF8574 I2C backpack
 * in 4-bit mode. Each nibble is latched by pulsing the EN
 * line via single-byte I2C writes to the PCF8574. All
 * timing margins exceed HD44780 datasheet minimums.
 *
 * MIT License
 *
 * Copyright (c) 2026 Kevin Thomas
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */
#include "rp2350_lcd1602.h"
#include "rp2350_i2c.h"
#include "rp2350_delay.h"

/**
  * @brief  Pulse the EN line to latch a nibble into the HD44780.
  *
  *         Writes the data byte with EN set, waits 1 us, then writes
  *         with EN cleared and waits 50 us for the controller to process.
  *
  * @param  data PCF8574 output byte (RS, backlight, and nibble already set)
  * @retval None
  */
static void lcd_pulse_enable(uint8_t data)
{
  i2c_write_byte(data | LCD_PIN_EN);
  delay_us(1);
  i2c_write_byte(data & ~LCD_PIN_EN);
  delay_us(50);
}

/**
  * @brief  Write one 4-bit nibble to the LCD controller.
  * @param  nibble lower 4 bits to send
  * @param  mode   0 for command, non-zero for character data
  * @retval None
  */
static void lcd_write4(uint8_t nibble, uint8_t mode)
{
  uint8_t data = (nibble & 0x0FU) << LCD_NIBBLE_SHIFT;
  data |= mode ? LCD_PIN_RS : 0U;
  data |= LCD_BACKLIGHT;
  lcd_pulse_enable(data);
}

/**
  * @brief  Send a full 8-bit value as two nibbles (high then low).
  * @param  value byte to send to the LCD
  * @param  mode  0 for command, non-zero for character data
  * @retval None
  */
static void lcd_send(uint8_t value, uint8_t mode)
{
  lcd_write4((value >> 4) & 0x0FU, mode);
  lcd_write4(value & 0x0FU, mode);
}

/**
  * @brief  Execute the HD44780 4-bit mode power-on reset sequence.
  *
  *         Sends 0x03 three times with required inter-command delays,
  *         then sends 0x02 to switch from 8-bit to 4-bit interface.
  *
  * @retval None
  */
static void lcd_hd44780_reset(void)
{
  lcd_write4(0x03, 0);
  delay_ms(5);
  lcd_write4(0x03, 0);
  delay_us(150);
  lcd_write4(0x03, 0);
  delay_us(150);
  lcd_write4(0x02, 0);
  delay_us(150);
}

/**
  * @brief  Send post-reset configuration commands to the HD44780.
  *
  *         Sets 4-bit mode with 2 display lines and 5x8 font, turns
  *         display on with cursor hidden, clears the screen, and
  *         selects left-to-right entry mode.
  *
  * @retval None
  */
static void lcd_hd44780_configure(void)
{
  lcd_send(LCD_CMD_FUNCTION_SET_4BIT, 0);
  lcd_send(LCD_CMD_DISPLAY_ON, 0);
  lcd_send(LCD_CMD_CLEAR, 0);
  delay_ms(2);
  lcd_send(LCD_CMD_ENTRY_MODE, 0);
}

void lcd_init(void)
{
  i2c_set_target(LCD_I2C_ADDR);
  lcd_hd44780_reset();
  lcd_hd44780_configure();
}

void lcd_clear(void)
{
  lcd_send(LCD_CMD_CLEAR, 0);
  delay_ms(2);
}

void lcd_set_cursor(uint8_t line, uint8_t position)
{
  uint8_t offset = (line == 0U) ? LCD_ROW0_OFFSET : LCD_ROW1_OFFSET;
  lcd_send(LCD_CMD_SET_DDRAM | (position + offset), 0);
}

void lcd_puts(const char *str)
{
  while (*str)
    lcd_send((uint8_t)*str++, 1);
}
